#include <iostream>
using namespace std;

int main(){ // AC ?
	int t, a1, a2, a3, a4;
	cin >> t;
	if(t != 0){ // 1
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 2
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 3
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 4
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 5
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 6
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 7
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 8
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 9
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 10
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 11
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 12
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 13
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 14
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 15
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 16
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 17
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 18
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 19
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	if(t != 0){ // 20
		cin >> a1 >> a2 >> a3 >> a4; // 輸入前四項
		cout << a1 << " " << a2 << " " << a3 << " " << a4 << " "; // 將前四項輸出
		if(a4 - a3 == a3 - a2){
			cout << a4 + (a3 - a2);
		}
		else{
			cout << a4 * (a3 / a2);
		}
		cout << "\n"; // 不要忘了換行
		t -= 1;
	}
	return 0;
}
